MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1613/mcu.h
// Register: CWG1AS0
#define CWG1AS0 CWG1AS0
extern volatile unsigned char           CWG1AS0             __at(0x693);
#ifndef _LIB_BUILD
asm("CWG1AS0 equ 0693h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSBD                   :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG1LSAC               :2;
        unsigned CWG1LSBD               :2;
        unsigned CWG1REN                :1;
        unsigned CWG1SHUTDOWN           :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG1LSAC0              :1;
        unsigned CWG1LSAC1              :1;
        unsigned CWG1LSBD0              :1;
        unsigned CWG1LSBD1              :1;
    };
} CWG1AS0bits_t;
extern volatile CWG1AS0bits_t CWG1AS0bits __at(0x693);
// bitfield macros
#define _CWG1AS0_LSAC_POSN                                  0x2
#define _CWG1AS0_LSAC_POSITION                              0x2
#define _CWG1AS0_LSAC_SIZE                                  0x2
#define _CWG1AS0_LSAC_LENGTH                                0x2
#define _CWG1AS0_LSAC_MASK                                  0xC
#define _CWG1AS0_LSBD_POSN                                  0x4
#define _CWG1AS0_LSBD_POSITION                              0x4
#define _CWG1AS0_LSBD_SIZE                                  0x2
#define _CWG1AS0_LSBD_LENGTH                                0x2
#define _CWG1AS0_LSBD_MASK                                  0x30
#define _CWG1AS0_REN_POSN                                   0x6
#define _CWG1AS0_REN_POSITION                               0x6
#define _CWG1AS0_REN_SIZE                                   0x1
#define _CWG1AS0_REN_LENGTH                                 0x1
#define _CWG1AS0_REN_MASK                                   0x40
#define _CWG1AS0_SHUTDOWN_POSN                              0x7
#define _CWG1AS0_SHUTDOWN_POSITION                          0x7
#define _CWG1AS0_SHUTDOWN_SIZE                              0x1
#define _CWG1AS0_SHUTDOWN_LENGTH                            0x1
#define _CWG1AS0_SHUTDOWN_MASK                              0x80
#define _CWG1AS0_LSAC0_POSN                                 0x2
#define _CWG1AS0_LSAC0_POSITION                             0x2
#define _CWG1AS0_LSAC0_SIZE                                 0x1
#define _CWG1AS0_LSAC0_LENGTH                               0x1
#define _CWG1AS0_LSAC0_MASK                                 0x4
#define _CWG1AS0_LSAC1_POSN                                 0x3
#define _CWG1AS0_LSAC1_POSITION                             0x3
#define _CWG1AS0_LSAC1_SIZE                                 0x1
#define _CWG1AS0_LSAC1_LENGTH                               0x1
#define _CWG1AS0_LSAC1_MASK                                 0x8
#define _CWG1AS0_LSBD0_POSN                                 0x4
#define _CWG1AS0_LSBD0_POSITION                             0x4
#define _CWG1AS0_LSBD0_SIZE                                 0x1
#define _CWG1AS0_LSBD0_LENGTH                               0x1
#define _CWG1AS0_LSBD0_MASK                                 0x10
#define _CWG1AS0_LSBD1_POSN                                 0x5
#define _CWG1AS0_LSBD1_POSITION                             0x5
#define _CWG1AS0_LSBD1_SIZE                                 0x1
#define _CWG1AS0_LSBD1_LENGTH                               0x1
#define _CWG1AS0_LSBD1_MASK                                 0x20
#define _CWG1AS0_CWG1LSAC_POSN                              0x2
#define _CWG1AS0_CWG1LSAC_POSITION                          0x2
#define _CWG1AS0_CWG1LSAC_SIZE                              0x2
#define _CWG1AS0_CWG1LSAC_LENGTH                            0x2
#define _CWG1AS0_CWG1LSAC_MASK                              0xC
#define _CWG1AS0_CWG1LSBD_POSN                              0x4
#define _CWG1AS0_CWG1LSBD_POSITION                          0x4
#define _CWG1AS0_CWG1LSBD_SIZE                              0x2
#define _CWG1AS0_CWG1LSBD_LENGTH                            0x2
#define _CWG1AS0_CWG1LSBD_MASK                              0x30
#define _CWG1AS0_CWG1REN_POSN                               0x6
#define _CWG1AS0_CWG1REN_POSITION                           0x6
#define _CWG1AS0_CWG1REN_SIZE                               0x1
#define _CWG1AS0_CWG1REN_LENGTH                             0x1
#define _CWG1AS0_CWG1REN_MASK                               0x40
#define _CWG1AS0_CWG1SHUTDOWN_POSN                          0x7
#define _CWG1AS0_CWG1SHUTDOWN_POSITION                      0x7
#define _CWG1AS0_CWG1SHUTDOWN_SIZE                          0x1
#define _CWG1AS0_CWG1SHUTDOWN_LENGTH                        0x1
#define _CWG1AS0_CWG1SHUTDOWN_MASK                          0x80
#define _CWG1AS0_CWG1LSAC0_POSN                             0x2
#define _CWG1AS0_CWG1LSAC0_POSITION                         0x2
#define _CWG1AS0_CWG1LSAC0_SIZE                             0x1
#define _CWG1AS0_CWG1LSAC0_LENGTH                           0x1
#define _CWG1AS0_CWG1LSAC0_MASK                             0x4
#define _CWG1AS0_CWG1LSAC1_POSN                             0x3
#define _CWG1AS0_CWG1LSAC1_POSITION                         0x3
#define _CWG1AS0_CWG1LSAC1_SIZE                             0x1
#define _CWG1AS0_CWG1LSAC1_LENGTH                           0x1
#define _CWG1AS0_CWG1LSAC1_MASK                             0x8
#define _CWG1AS0_CWG1LSBD0_POSN                             0x4
#define _CWG1AS0_CWG1LSBD0_POSITION                         0x4
#define _CWG1AS0_CWG1LSBD0_SIZE                             0x1
#define _CWG1AS0_CWG1LSBD0_LENGTH                           0x1
#define _CWG1AS0_CWG1LSBD0_MASK                             0x10
#define _CWG1AS0_CWG1LSBD1_POSN                             0x5
#define _CWG1AS0_CWG1LSBD1_POSITION                         0x5
#define _CWG1AS0_CWG1LSBD1_SIZE                             0x1
#define _CWG1AS0_CWG1LSBD1_LENGTH                           0x1
#define _CWG1AS0_CWG1LSBD1_MASK                             0x20

// Register: CWG1AS1
#define CWG1AS1 CWG1AS1
extern volatile unsigned char           CWG1AS1             __at(0x694);
#ifndef _LIB_BUILD
asm("CWG1AS1 equ 0694h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INAS                   :1;
        unsigned C1AS                   :1;
        unsigned C2AS                   :1;
        unsigned                        :1;
        unsigned TMR2AS                 :1;
        unsigned TMR4AS                 :1;
        unsigned TMR6AS                 :1;
    };
    struct {
        unsigned CWG1INAS               :1;
        unsigned CWG1C1AS               :1;
        unsigned CWG1C2AS               :1;
        unsigned                        :1;
        unsigned CWG1TMR2AS             :1;
        unsigned CWG1TMR4AS             :1;
        unsigned CWG1TMR6AS             :1;
    };
} CWG1AS1bits_t;
extern volatile CWG1AS1bits_t CWG1AS1bits __at(0x694);
// bitfield macros
#define _CWG1AS1_INAS_POSN                                  0x0
#define _CWG1AS1_INAS_POSITION                              0x0
#define _CWG1AS1_INAS_SIZE                                  0x1
#define _CWG1AS1_INAS_LENGTH                                0x1
#define _CWG1AS1_INAS_MASK                                  0x1
#define _CWG1AS1_C1AS_POSN                                  0x1
#define _CWG1AS1_C1AS_POSITION                              0x1
#define _CWG1AS1_C1AS_SIZE                                  0x1
#define _CWG1AS1_C1AS_LENGTH                                0x1
#define _CWG1AS1_C1AS_MASK                                  0x2
#define _CWG1AS1_C2AS_POSN                                  0x2
#define _CWG1AS1_C2AS_POSITION                              0x2
#define _CWG1AS1_C2AS_SIZE                                  0x1
#define _CWG1AS1_C2AS_LENGTH                                0x1
#define _CWG1AS1_C2AS_MASK                                  0x4
#define _CWG1AS1_TMR2AS_POSN                                0x4
#define _CWG1AS1_TMR2AS_POSITION                            0x4
#define _CWG1AS1_TMR2AS_SIZE                                0x1
#define _CWG1AS1_TMR2AS_LENGTH                              0x1
#define _CWG1AS1_TMR2AS_MASK                                0x10
#define _CWG1AS1_TMR4AS_POSN                                0x5
#define _CWG1AS1_TMR4AS_POSITION                            0x5
#define _CWG1AS1_TMR4AS_SIZE                                0x1
#define _CWG1AS1_TMR4AS_LENGTH                              0x1
#define _CWG1AS1_TMR4AS_MASK                                0x20
#define _CWG1AS1_TMR6AS_POSN                                0x6
#define _CWG1AS1_TMR6AS_POSITION                            0x6
#define _CWG1AS1_TMR6AS_SIZE                                0x1
#define _CWG1AS1_TMR6AS_LENGTH                              0x1
#define _CWG1AS1_TMR6AS_MASK                                0x40
#define _CWG1AS1_CWG1INAS_POSN                              0x0
#define _CWG1AS1_CWG1INAS_POSITION                          0x0
#define _CWG1AS1_CWG1INAS_SIZE                              0x1
#define _CWG1AS1_CWG1INAS_LENGTH                            0x1
#define _CWG1AS1_CWG1INAS_MASK                              0x1
#define _CWG1AS1_CWG1C1AS_POSN                              0x1
#define _CWG1AS1_CWG1C1AS_POSITION                          0x1
#define _CWG1AS1_CWG1C1AS_SIZE                              0x1
#define _CWG1AS1_CWG1C1AS_LENGTH                            0x1
#define _CWG1AS1_CWG1C1AS_MASK                              0x2
#define _CWG1AS1_CWG1C2AS_POSN                              0x2
#define _CWG1AS1_CWG1C2AS_POSITION                          0x2
#define _CWG1AS1_CWG1C2AS_SIZE                              0x1
#define _CWG1AS1_CWG1C2AS_LENGTH                            0x1
#define _CWG1AS1_CWG1C2AS_MASK                              0x4
#define _CWG1AS1_CWG1TMR2AS_POSN                            0x4
#define _CWG1AS1_CWG1TMR2AS_POSITION                        0x4
#define _CWG1AS1_CWG1TMR2AS_SIZE                            0x1
#define _CWG1AS1_CWG1TMR2AS_LENGTH                          0x1
#define _CWG1AS1_CWG1TMR2AS_MASK                            0x10
#define _CWG1AS1_CWG1TMR4AS_POSN                            0x5
#define _CWG1AS1_CWG1TMR4AS_POSITION                        0x5
#define _CWG1AS1_CWG1TMR4AS_SIZE                            0x1
#define _CWG1AS1_CWG1TMR4AS_LENGTH                          0x1
#define _CWG1AS1_CWG1TMR4AS_MASK                            0x20
#define _CWG1AS1_CWG1TMR6AS_POSN                            0x6
#define _CWG1AS1_CWG1TMR6AS_POSITION                        0x6
#define _CWG1AS1_CWG1TMR6AS_SIZE                            0x1
#define _CWG1AS1_CWG1TMR6AS_LENGTH                          0x1
#define _CWG1AS1_CWG1TMR6AS_MASK                            0x40

