MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1613/mcu.h
// Register: CRCCON1
#define CRCCON1 CRCCON1
extern volatile unsigned char           CRCCON1             __at(0x79A);
#ifndef _LIB_BUILD
asm("CRCCON1 equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLEN                   :4;
        unsigned DLEN                   :4;
    };
    struct {
        unsigned PLEN0                  :1;
        unsigned PLEN1                  :1;
        unsigned PLEN2                  :1;
        unsigned PLEN3                  :1;
        unsigned DLEN0                  :1;
        unsigned DLEN1                  :1;
        unsigned DLEN2                  :1;
        unsigned DLEN3                  :1;
    };
    struct {
        unsigned CRCPLEN                :4;
        unsigned CRCDLEN                :4;
    };
    struct {
        unsigned CRCPLEN0               :1;
        unsigned CRCPLEN1               :1;
        unsigned CRCPLEN2               :1;
        unsigned CRCPLEN3               :1;
        unsigned CRCDLEN0               :1;
        unsigned CRCDLEN1               :1;
        unsigned CRCDLEN2               :1;
        unsigned CRCDLEN3               :1;
    };
} CRCCON1bits_t;
extern volatile CRCCON1bits_t CRCCON1bits __at(0x79A);
// bitfield macros
#define _CRCCON1_PLEN_POSN                                  0x0
#define _CRCCON1_PLEN_POSITION                              0x0
#define _CRCCON1_PLEN_SIZE                                  0x4
#define _CRCCON1_PLEN_LENGTH                                0x4
#define _CRCCON1_PLEN_MASK                                  0xF
#define _CRCCON1_DLEN_POSN                                  0x4
#define _CRCCON1_DLEN_POSITION                              0x4
#define _CRCCON1_DLEN_SIZE                                  0x4
#define _CRCCON1_DLEN_LENGTH                                0x4
#define _CRCCON1_DLEN_MASK                                  0xF0
#define _CRCCON1_PLEN0_POSN                                 0x0
#define _CRCCON1_PLEN0_POSITION                             0x0
#define _CRCCON1_PLEN0_SIZE                                 0x1
#define _CRCCON1_PLEN0_LENGTH                               0x1
#define _CRCCON1_PLEN0_MASK                                 0x1
#define _CRCCON1_PLEN1_POSN                                 0x1
#define _CRCCON1_PLEN1_POSITION                             0x1
#define _CRCCON1_PLEN1_SIZE                                 0x1
#define _CRCCON1_PLEN1_LENGTH                               0x1
#define _CRCCON1_PLEN1_MASK                                 0x2
#define _CRCCON1_PLEN2_POSN                                 0x2
#define _CRCCON1_PLEN2_POSITION                             0x2
#define _CRCCON1_PLEN2_SIZE                                 0x1
#define _CRCCON1_PLEN2_LENGTH                               0x1
#define _CRCCON1_PLEN2_MASK                                 0x4
#define _CRCCON1_PLEN3_POSN                                 0x3
#define _CRCCON1_PLEN3_POSITION                             0x3
#define _CRCCON1_PLEN3_SIZE                                 0x1
#define _CRCCON1_PLEN3_LENGTH                               0x1
#define _CRCCON1_PLEN3_MASK                                 0x8
#define _CRCCON1_DLEN0_POSN                                 0x4
#define _CRCCON1_DLEN0_POSITION                             0x4
#define _CRCCON1_DLEN0_SIZE                                 0x1
#define _CRCCON1_DLEN0_LENGTH                               0x1
#define _CRCCON1_DLEN0_MASK                                 0x10
#define _CRCCON1_DLEN1_POSN                                 0x5
#define _CRCCON1_DLEN1_POSITION                             0x5
#define _CRCCON1_DLEN1_SIZE                                 0x1
#define _CRCCON1_DLEN1_LENGTH                               0x1
#define _CRCCON1_DLEN1_MASK                                 0x20
#define _CRCCON1_DLEN2_POSN                                 0x6
#define _CRCCON1_DLEN2_POSITION                             0x6
#define _CRCCON1_DLEN2_SIZE                                 0x1
#define _CRCCON1_DLEN2_LENGTH                               0x1
#define _CRCCON1_DLEN2_MASK                                 0x40
#define _CRCCON1_DLEN3_POSN                                 0x7
#define _CRCCON1_DLEN3_POSITION                             0x7
#define _CRCCON1_DLEN3_SIZE                                 0x1
#define _CRCCON1_DLEN3_LENGTH                               0x1
#define _CRCCON1_DLEN3_MASK                                 0x80
#define _CRCCON1_CRCPLEN_POSN                               0x0
#define _CRCCON1_CRCPLEN_POSITION                           0x0
#define _CRCCON1_CRCPLEN_SIZE                               0x4
#define _CRCCON1_CRCPLEN_LENGTH                             0x4
#define _CRCCON1_CRCPLEN_MASK                               0xF
#define _CRCCON1_CRCDLEN_POSN                               0x4
#define _CRCCON1_CRCDLEN_POSITION                           0x4
#define _CRCCON1_CRCDLEN_SIZE                               0x4
#define _CRCCON1_CRCDLEN_LENGTH                             0x4
#define _CRCCON1_CRCDLEN_MASK                               0xF0
#define _CRCCON1_CRCPLEN0_POSN                              0x0
#define _CRCCON1_CRCPLEN0_POSITION                          0x0
#define _CRCCON1_CRCPLEN0_SIZE                              0x1
#define _CRCCON1_CRCPLEN0_LENGTH                            0x1
#define _CRCCON1_CRCPLEN0_MASK                              0x1
#define _CRCCON1_CRCPLEN1_POSN                              0x1
#define _CRCCON1_CRCPLEN1_POSITION                          0x1
#define _CRCCON1_CRCPLEN1_SIZE                              0x1
#define _CRCCON1_CRCPLEN1_LENGTH                            0x1
#define _CRCCON1_CRCPLEN1_MASK                              0x2
#define _CRCCON1_CRCPLEN2_POSN                              0x2
#define _CRCCON1_CRCPLEN2_POSITION                          0x2
#define _CRCCON1_CRCPLEN2_SIZE                              0x1
#define _CRCCON1_CRCPLEN2_LENGTH                            0x1
#define _CRCCON1_CRCPLEN2_MASK                              0x4
#define _CRCCON1_CRCPLEN3_POSN                              0x3
#define _CRCCON1_CRCPLEN3_POSITION                          0x3
#define _CRCCON1_CRCPLEN3_SIZE                              0x1
#define _CRCCON1_CRCPLEN3_LENGTH                            0x1
#define _CRCCON1_CRCPLEN3_MASK                              0x8
#define _CRCCON1_CRCDLEN0_POSN                              0x4
#define _CRCCON1_CRCDLEN0_POSITION                          0x4
#define _CRCCON1_CRCDLEN0_SIZE                              0x1
#define _CRCCON1_CRCDLEN0_LENGTH                            0x1
#define _CRCCON1_CRCDLEN0_MASK                              0x10
#define _CRCCON1_CRCDLEN1_POSN                              0x5
#define _CRCCON1_CRCDLEN1_POSITION                          0x5
#define _CRCCON1_CRCDLEN1_SIZE                              0x1
#define _CRCCON1_CRCDLEN1_LENGTH                            0x1
#define _CRCCON1_CRCDLEN1_MASK                              0x20
#define _CRCCON1_CRCDLEN2_POSN                              0x6
#define _CRCCON1_CRCDLEN2_POSITION                          0x6
#define _CRCCON1_CRCDLEN2_SIZE                              0x1
#define _CRCCON1_CRCDLEN2_LENGTH                            0x1
#define _CRCCON1_CRCDLEN2_MASK                              0x40
#define _CRCCON1_CRCDLEN3_POSN                              0x7
#define _CRCCON1_CRCDLEN3_POSITION                          0x7
#define _CRCCON1_CRCDLEN3_SIZE                              0x1
#define _CRCCON1_CRCDLEN3_LENGTH                            0x1
#define _CRCCON1_CRCDLEN3_MASK                              0x80

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
#ifndef __CCI__
extern volatile __uint24                SMT1TMR             __at(0xD8C);
#endif
#ifndef _LIB_BUILD
asm("SMT1TMR equ 0D8Ch");
#endif

